const finalPrompt = `
      이 음성 텍스트는 회의 중 기록된 대화입니다. 또한 아래의 마인드맵 노드는 회의중 작성된 노드입니다.
      해당 노드의 테스트를 키워드로 생각하고, 음성텍스트의 내용 또한 반영하여서 새롭게 생성할만한 노드가 있으면 반환해주세요.    
      아래 내용과 노드 데이터를 기준으로 텍스트를 자연스럽게 수정하고, 요약 및 회의록을 작성해주세요.

      음성 텍스트:
      ${prompt}

      마인드맵 노드:
      ${mindmapData}

      1. 자연스럽게 수정된 SRT 파일을 반환하세요.
      2. SRT 텍스트를 기반으로 회의록을 작성하세요:
        - **주요 주제**
        - **다음 할 일**
        - **요약**
        - **키워드**

      응답은 아래 형식으로 반환해주세요:
      ---
      ### SRT 파일:
      <SRT 내용>

      ---
      ### 회의록:
      **주요 주제**
      - [내용]

      **다음 할 일**
      - [내용]

      **요약**
      [간단한 요약 내용]
      ---
      ### 키워드 

      ** 주요 키워드**
      [키워드 목록]
      ---
      ### 추가할 노드
      [노드 목록]
          `;  