const thisMeetingContent02 = require("./meetingContent");

const data = ` ### SRT 파일:
1
00:00:00,679 --> 00:00:10,435
A: 안녕하세요. 현재 개발 중인 부분에 대해 말씀드리겠습니다. 회의 기록이 DB에 문제없이
 저장되는 것과 더불어, 그 결과값이 프론트에서 적절하게 출력될 수 있도록 하는 과정이  
필요합니다.

2
00:00:10,435 --> 00:00:18,070
A: 이는 회의록, 그 중에서도 대화 내용, 요약된 부분, 그리고 키워드를 모두 포함해서 출 
력해야 하는 문제입니다.

3
00:00:18,070 --> 00:00:22,850
A: 이미 일부 수정을 진행했기 때문에, 그 효과를 확인하기 위해 실제로 출력테스트를 진행
해보겠습니다. 아무쪼록 긍정적인 결과가 나왔으면 좋겠습니다.

---
### 회의록:
**주요 주제**
- 회의 기록의 DB 저장 및 프론트 출력에 대한 이슈
- 수정 완료된 부분에 대한 출력 테스트 실행

**요약**
회의록이 DB에 적절하게 저장되어야 하며, 반환된 응답 값이 프론트에서 잘   력되도록 개 
출력되도록 개발 과정이 필요하다. 이는 회의 대화 내용, 요약부분 및 키워드 해야 한다.  
까지 모두 포함해야 한다. 일부 수정이 완료되어 출력 테스트를 진행할 계획 
이다.
---
### 키워드

** 주요 키워드**
- 회의록, DB 저장, 프론트 출력, 개발 이슈, 수정, 출력 테스트 실행    `;

const report = thisMeetingContent02(data);

console.log(report);
