import parseSRT  from "./parseSRT.js";

const ai = `OpenAI 응답: ### SRT 파일:

    OpenAI 응답: ### SRT 파일:

    1
    00:00:00,000 --> 00:00:07,400
    김선준: 녹음 시작. 여러분, 저는 굉장히 배고파요. 진짜 저도 배고프다. 너무 배고프네요.

    2
    00:00:07,400 --> 00:00:10,152
    chan5337: 저는 국물 종류가 땡기네요. 목이 좀 아파서 그런 것 같아요.

    3
    00:00:10,152 --> 00:00:14,636
    kiup: 순두부찌개 어때요? 그때 순두부찌개 있었던 것 같은데.

    4
    00:00:14,636 --> 00:00:16,318
    chan5337: 순두부찌개면 맛있겠네요.

    5
    00:00:16,318 --> 00:00:23,740
    kiup: 새우튀김이나 새우, 혹은 치킨 마요도 괜찮을 것 같아요. 그런데 치킨 마요 치킨은 없어진 거 아니에요?

    6
    00:00:23,740 --> 00:00:31,980
    kiup: 그런 치킨은 시즌 메뉴였어. 메뉴가 바뀌었어. 그 얘기를 녹음하려고 했어.

---

`;

const response = parseSRT(ai);
console.log(response);
